{
    "⁠⁠⁠⁠announcement:announce": "Sent when there is a site-wide announcement. The message property of the body contains the announcement text. Other fields affect how the announcement is displayed on beam.pro",
    "channel:{id}:followed": "Sent when a user follows or unfollows a channel. The body will contain an attribute `following` - boolean set to true `true` if the user just followed the channel, `false` if they unfollowed, and user - the [User](/rest.html#User) who just followed the channel.",
    "channel:{id}:hosted": "Sent when another user hosts the channel with the provided `id`. The body will contain the `hosterId`, a number, and `hoster`, the full [Channel](/rest.html#Channel) model who started hosting this channel. Note that this event is not subject to the spam prevention that the chat message is.",
    "channel:{id}:unhosted": "Sent when another user finishes hosting the channel with the provided `id`. The body will contain the `hosterId`, a number, and `hoster`, the full [Channel](/rest.html#Channel) model who finished hosting this channel. Note that this event is not subject to the spam prevention that the chat message is.",
    "channel:{id}:status": "Subscribes to the online status of a channel. You'll get events sent down named `chat:{id}:StartStreaming` and `chat:{id}:StopStreaming`.",
    "channel:{id}:subscribed": "Sent when a user subscribes to the channel. The body will contain the [User](/rest.html#User) object who just subscribed to the channel.",
    "channel:{id}:resubscribed": "Sent when an automatic resubscription to a channel happens. The body will contain the [User](/rest.html#User) object of the channel the user just resubscribed to. Additionally there are `since` and `until` properties. These are the dates for when the user first subscribed (from the start of recurring billing period) and when the subscription expires. Finally there's a `totalMonths` property, which is an integer indicating how many months the user has been subscribed since the beginning of time.",
    "channel:{id}:update": "You'll get an event sent down that matches the slug, containing changes on the [Channel model](/rest.html#Channel). The event may not necessarily include the entire channel resource. For example, when a channel goes online, an event with the key online going to true is sent.",
    "interactive:{id}:connect": "Sent when an interactive app connects to this channel",
    "interactive:{id}:disconnected": "Sent when an interactive app disconnects from this channel",
    "team:{id}:deleted": "Sent when a [Team](/rest.html#Team) is deleted. The body will contain the team's old record.",
    "team:{id}:memberAccepted": "Sent when an invitee accepts their team invitation. The body will contain the accepting user's record.",
    "team:{id}:memberInvited": "Sent when a member is invited to a team. The body will contain the invited user's record.",
    "team:{id}:memberRemoved": "Sent when a team member leaves or invitee rejects their invite. The body will contain the member's [User](/rest.html#User) record.",
    "team:{id}:ownerChanged": "Sent when a team's ownership changes. The body will contain the new owner's [User](/rest.html#User) record.",
    "user:{id}:achievement": "Sent when a user achievement earning is updated. The body is simply an [AchievementEarning](/rest.html#AchievementEarning) record as returned in the achievement user listing endpoint.",
    "user:{id}:followed": "Sent when a user follows or unfollows a channel. The body will contain an attribute `following` - boolean set to true `true` if the user just followed the channel, `false` if they unfollowed, and user - the [User](/rest.html#User) who just followed the channel.",
    "user:{id}:notify": "Sent when a new user [Notification](/rest.html#Notification) is created. Notifications of the same type will always follow the same structure.",
    "user:{id}:subscribed": "Sent when the user subscribes to a channel. The body will contain the channel ID that they just subscribed to.",
    "user:{id}:resubscribed": "Sent when an automatic resubscription to a channel happens. The body will contain the [Channel](/rest.html#Channel) id of the channel the user just resubscribed to. Additionally there are `since` and `until` properties. These are the dates for when the user first subscribed (from the start of recurring billing period) and when the subscription expires. Finally there's a `totalMonths` property, which is an integer indicating how many months the user has been subscribed since the beginning of time.",
    "user:{id}:teamAccepted": "Sent when a user accepts their invite to a team. The body will contain the [Team](/rest.html#Team) record related to the event.",
    "user:{id}:teamInvited": "Sent when a user is invited to a team. The body will contain the [Team](/rest.html#Team) record related to the event.",
    "user:{id}:teamRemoved": "Sent when a user leaves a team or rejects its invite. The body will contain the [Team](/rest.html#Team) record related to the event.",
    "user:{id}:update": "You'll get an event sent down that matches the slug, containing changes on the [User model](/rest.html#User). The event may not necessarily include the entire user resource."
}
